Revit 2024 API
IDuctPressureDropServer.Calculate Method
 Calculate the duct pressure drop.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
void Calculate(
	DuctPressureDropData data
)
Visual Basic
Sub Calculate ( _
	data As DuctPressureDropData _
)
Visual C++
void Calculate(
	DuctPressureDropData^ data
)
Parameters
data
Type: Autodesk.Revit.DB.Mechanical.DuctPressureDropData
 The input and output data of the calculation.
See Also
IDuctPressureDropServer Interface
Autodesk.Revit.DB.Mechanical Namespace